Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/InformationRegisters/ЖанрыФильмов/ЖанрыФильмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖанрыФильмов</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Жанр</name>
    <type>
      <types>CatalogRef.Жанры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/InformationRegisters/СтраныПроизводители/СтраныПроизводители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтраныПроизводители</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Страна</name>
    <type>
      <types>CatalogRef.Страны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/InformationRegisters/ДатыСкачиванияФильмов/ДатыСкачиванияФильмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыСкачиванияФильмов</name>
  <resources>
    <name>ДатаСкачивания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/Catalogs/Фильмы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Наименование") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
		Если Параметры.Свойство("Афиша") Тогда
			ТекКартинка      = ПолучитьИзВременногоХранилища(Параметры.Афиша);
			мДвоичныеДанные  = ?(ТипЗнч(ТекКартинка) = Тип("Картинка"), ТекКартинка.ПолучитьДвоичныеДанные(), Неопределено);
			Объект.РазмерИзображения = ?(ТипЗнч(мДвоичныеДанные) = Тип("ДвоичныеДанные"), мДвоичныеДанные.Размер(), 0);
			АдресИзображения = Параметры.Афиша;
		КонецЕсли;
	ИначеЕсли Объект.Ссылка.Афиша.Получить() = Неопределено Тогда
		Элементы.ПостерОтсутствует.Видимость		= Истина;
		Элементы.ПостерОтсутствует.РазмерКартинки	= РазмерКартинки.АвтоРазмер;
		Элементы.АдресИзображения.Видимость			= Ложь;
	Иначе
		АдресИзображения = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Афиша");
	КонецЕсли;
	
	Элементы.АдресИзображения.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	
	ЗаполнитьЖанрыИСтраныФильма();
	
	ЗаполнитьАннотациюФильма();
	
	Элементы.ДекорацияБайт.Заголовок = ПолучитьСклонениеОбъема(Объект.РазмерИзображения);
	
	УстановитьВидимостьРеквизитаИмяФайла(ЭтотОбъект, Объект.ЕстьВФильмотеке);
	
	МаксимальныйРазмерИзображения = Константы.МаксимальныйРазмерИзображения.Получить();
	
	ОтразитьНадписьРазмерИзображения(ЭтотОбъект, Объект.РазмерИзображения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если Объект.НужноСкачать И Объект.ЕстьВФильмотеке Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Внимание:", , "Фильм уже есть - качать не нужно!", БиблиотекаКартинок.УдалитьНепосредственно);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаВыхода) И ЗначениеЗаполнено(Объект.Родитель) Тогда
		ГодВыхода = Формат(Объект.ДатаВыхода, "ДФ=yyyy");
		ИмяРодителя = Строка(Объект.Родитель);
		Если ГодВыхода <> ИмяРодителя Тогда
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект, Отказ);
			ТекстВопроса = СтрЗаменить(СтрЗаменить("Год выхода фильма ""%1"", а группа где находится фильм ""%2"", все верно?", "%1", ГодВыхода), "%2", ИмяРодителя);
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ЭтоАдресВременногоХранилища(АдресИзображения) Тогда
		ТекущийОбъект.Афиша = Новый ХранилищеЗначения(Новый Картинка(ПолучитьИзВременногоХранилища(АдресИзображения)));
	КонецЕсли;
	
	Если ОчиститьИзображениеПередЗаписью Тогда
		ТекущийОбъект.Афиша = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// Жанры
	НаборЗаписей = РегистрыСведений.ЖанрыФильмов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Фильм.Установить(ТекущийОбъект.Ссылка);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Жанры.Относится,
		|	Жанры.Жанр
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&Жанры КАК Жанры
		|ГДЕ
		|	Жанры.Относится
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Фильм,
		|	ВТ.Жанр
		|ИЗ
		|	ВТ КАК ВТ");
	Запрос.УстановитьПараметр("Фильм", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("Жанры", РеквизитФормыВЗначение("Жанры"));
	
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Попытка
	    НаборЗаписей.Записать();
	Исключение
	КонецПопытки;

	// Страны
	НаборЗаписей = РегистрыСведений.СтраныПроизводители.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Фильм.Установить(ТекущийОбъект.Ссылка);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Страны.Относится,
		|	Страны.Страна
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&Страны КАК Страны
		|ГДЕ
		|	Страны.Относится
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Фильм,
		|	ВТ.Страна
		|ИЗ
		|	ВТ КАК ВТ");
	Запрос.УстановитьПараметр("Фильм", ТекущийОбъект.Ссылка);
	Запрос.УстановитьПараметр("Страны", РеквизитФормыВЗначение("Страны"));
	
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Попытка
	    НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
	
	Если НЕ ТекущийОбъект.ЕстьВФильмотеке Тогда
		НаборЗаписей = РегистрыСведений.ДатыСкачиванияФильмов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Фильм.Установить(ТекущийОбъект.Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
			Попытка
			    НаборЗаписей.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура АдресИзображенияНажатие(Элемент, СтандартнаяОбработка)

	ОткрытьДиалогВыбораФайлаИзображения(СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПостерОтсутствуетНажатие(Элемент)

	СтандартнаяОбработка = Ложь;
	
	ОткрытьДиалогВыбораФайлаИзображения(СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура СтраныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "СтраныСтрана" ИЛИ Поле.Имя = "СтраныФлаг" Тогда
		//ПоказатьЗначение( , Элементы.Страны.ТекущиеДанные.Страна);
		мТекущиеДанные = Элементы.Страны.ТекущиеДанные;
		мТекущиеДанные.Относится = НЕ мТекущиеДанные.Относится;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖанрыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ЖанрыЖанр" Тогда
		СтруктураОтбора = Новый Структура("Жанр", Элементы.Жанры.ТекущиеДанные.Жанр);
		ПараметрыФормы = Новый Структура("Отбор, КлючВарианта, СформироватьПриОткрытии", СтруктураОтбора, "ПоФильмам", Истина);
		ОткрытьФорму("Отчет.ОтчетПоЖанрам.Форма", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖанрыОтноситсяПриИзменении(Элемент)

	ЭтотОбъект.Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЕстьВФильмотекеПриИзменении(Элемент)

	Если Объект.ЕстьВФильмотеке И Объект.НужноСкачать Тогда
		Объект.НужноСкачать = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьРеквизитаИмяФайла(ЭтотОбъект, Объект.ЕстьВФильмотеке);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Если Объект.Ссылка.Пустая() Тогда
		Наименование = СокрЛП(Объект.Наименование);
		Разделитель = СтрНайти(Наименование, Символ(182), НаправлениеПоиска.СНачала);
		Если Разделитель > 0 Тогда
			ОригинальноеНазвание = Сред(Наименование, Разделитель + 1);
			Если НЕ ПустаяСтрока(ОригинальноеНазвание) Тогда
				Объект.ОригинальноеНазвание = ОригинальноеНазвание;
			КонецЕсли;
			Наименование = Лев(Наименование, Разделитель - 1);
		КонецЕсли;
		Объект.Наименование = Наименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИзображениеНаДиск(Команда)
	
	Если ПустаяСтрока(АдресИзображения) Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Нет изображения'"), , НСтр("ru = 'Изображение отсутствует, сохранить невозможно!'"), БиблиотекаКартинок.УдалитьНепосредственно);
		Возврат;
	ИначеЕсли Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Объект не записан'"), , НСтр("ru = 'Запишите предварительно объект!'"), БиблиотекаКартинок.УдалитьНепосредственно);
		Возврат;
	КонецЕсли;

	ОчиститьИзображениеПередЗаписью = Ложь;
	
	НаименованиеФайла = ОбщийМодульКлиентСервер.ЗаменитьНедопустимыеСимволы(Объект.Наименование);
	ПутьИзображения	= ОбщийМодульВызовСервера.ЗагрузитьНастройкуИзХранилища("СправочникФильмы", "ПутьСохраняемогоИзображения");
	АдресКартинки	= ПолучитьАдресВоВремХранилище();
	ТекКартинка		= ПолучитьИзВременногоХранилища(АдресКартинки);
	Расширение		= НРег(ТекКартинка.Формат());
	ДопПараметры	= Новый Структура("АдресКартинки, Расширение, ПутьИзображения, ЗапуститьПриложение", АдресКартинки, Расширение, ПутьИзображения, Ложь);
	ПутьИзображения = ?(ПутьИзображения = Неопределено, "", ПутьИзображения);
	ПолноеИмяФайла	= ПутьИзображения + НаименованиеФайла + "." + Расширение;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = НСтр("ru = 'Файл картинки (*.'") + Расширение + ")|*." + Расширение;
	Диалог.ПолноеИмяФайла = ПолноеИмяФайла;
	Диалог.Показать(Новый ОписаниеОповещения("ПослеЗакрытияДиалогаСохранение", ЭтотОбъект, ДопПараметры));

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)

	СтандартнаяОбработка = Истина;
	
	ОткрытьДиалогВыбораФайлаИзображения(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИзображение(Команда)

	АдресИзображения = "";
	Объект.РазмерИзображения = 0;
	Объект.ШиринаИзображения = 0;
	Объект.ВысотаИзображения = 0;
	Модифицированность = Истина;

	ОчиститьИзображениеПередЗаписью = Истина;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьИзображение(Команда)
	
	IDНаКиноПоиске = Ждать ТекстИзБуфераОбмена();
	Если НЕ ПустаяСтрока(IDНаКиноПоиске) И ОбщийМодульКлиентСервер.ТолькоЦифрыВСтроке(IDНаКиноПоиске) Тогда
		ПослеВводаЗначения(IDНаКиноПоиске, Неопределено);
	Иначе
		ПоказатьВводЗначения(Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект), IDНаКиноПоиске,
							 НСтр("ru = 'ID на КиноПоиске'"), Новый ОписаниеТипов("Строка", ,
							 Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная)));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОткрыть(Команда)
	
	АдресКартинки = ПолучитьАдресВоВремХранилище();
	ТекКартинка   = ПолучитьИзВременногоХранилища(АдресКартинки);
	
	Если ТекКартинка = Неопределено Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Нет изображения'"), , НСтр("ru = 'Изображение отсутствует, сохранить невозможно!'"), БиблиотекаКартинок.УдалитьНепосредственно);
		Возврат;
	КонецЕсли;
	
	НаименованиеФайла = ОбщийМодульКлиентСервер.ЗаменитьНедопустимыеСимволы(Объект.Наименование);
	ПутьИзображения	  = ОбщийМодульВызовСервера.ЗагрузитьНастройкуИзХранилища("СправочникФильмы", "ПутьСохраняемогоИзображения");
	Расширение		  = НРег(ТекКартинка.Формат());
	ДопПараметры	  = Новый Структура("АдресКартинки, Расширение, ПутьИзображения, ЗапуститьПриложение", АдресКартинки, Расширение, ПутьИзображения, Истина);
	ПутьИзображения   = ?(ПутьИзображения = Неопределено, "", ПутьИзображения);
	ПолноеИмяФайла	  = ПутьИзображения + НаименованиеФайла + "." + Расширение;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = НСтр("ru = 'Файл картинки (*.'") + Расширение + ")|*." + Расширение;
	Диалог.ПолноеИмяФайла = ПолноеИмяФайла;
	Диалог.Показать(Новый ОписаниеОповещения("ПослеЗакрытияДиалогаСохранение", ЭтотОбъект, ДопПараметры));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьАдресВоВремХранилище()

	ТекКартинка = РеквизитФормыВЗначение("Объект").Афиша.Получить();
	
	Возврат ПоместитьВоВременноеХранилище(ТекКартинка, УникальныйИдентификатор);

КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияДиалогаСохранение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		
		ТекКартинка   = ПолучитьИзВременногоХранилища(ДополнительныеПараметры.АдресКартинки);
		ВыбранныйФайл = ВыбранныеФайлы.Получить(0);
		ВремФайл      = Новый Файл(ВыбранныйФайл);
		ПолноеИмя     = ВремФайл.Путь + ВремФайл.ИмяБезРасширения + "." + ДополнительныеПараметры.Расширение;
		ДвчДанные     = ТекКартинка.ПолучитьДвоичныеДанные();
		ПутьИзображения = ДополнительныеПараметры.ПутьИзображения;
		
		ДопПараметры = Новый Структура("ИмяФайла, ПолноеИмя, ЗапуститьПриложение", ВремФайл.Имя, ПолноеИмя, ДополнительныеПараметры.ЗапуститьПриложение);
		
		Если ВремФайл.Путь <> ПутьИзображения Тогда
			ОбщийМодульВызовСервера.СохранитьНастройкуВХранилище("СправочникФильмы", "ПутьСохраняемогоИзображения", ВремФайл.Путь);
		КонецЕсли;
		
		ДвчДанные.НачатьЗапись(Новый ОписаниеОповещения("ПослеЗаписиДвоичныхДанных", ЭтотОбъект, ДопПараметры), ПолноеИмя);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиДвоичныхДанных(ДопПараметры) Экспорт
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Записано'"), , СтрЗаменить(НСтр("ru = 'Файл %1 успешно записан'"), "%1", ДопПараметры.ИмяФайла), БиблиотекаКартинок.СохранитьНаДиск48);
	
	Если ДопПараметры.ЗапуститьПриложение Тогда
		ЗапуститьПриложениеАсинх("""" + ДопПараметры.ПолноеИмя + """");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогВыбораФайлаИзображения(СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОчиститьИзображениеПередЗаписью = Ложь;
	
	Оповещение		 = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = ОбщийМодульКлиентСервер.ПолучитьФильтрИзображений();
	
	НачатьПомещениеФайлаНаСервер(Оповещение, , , , ПараметрыДиалога, УникальныйИдентификатор);
	
КонецПроцедуры // ОткрытьДиалогВыбораФайлаИзображения()

&НаКлиенте
Процедура ОбработатьВыборФайла(ОписаниеПомещенногоФайла, ДопПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	ИначеЕсли ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;

	АдресВременногоХранилища = ОписаниеПомещенногоФайла.Адрес;
	ВыбранноеИмяФайла		 = ОписаниеПомещенногоФайла.СсылкаНаФайл.Файл.ПолноеИмя;
	
	Оповещение    = Новый ОписаниеОповещения("ПослеЗавершенияПолучениеРазмераФайла", ЭтотОбъект, Новый Структура("АдресИзображения", АдресВременногоХранилища));
	ВыбранныйФайл = Новый Файл(ВыбранноеИмяФайла);
	ВыбранныйФайл.НачатьПолучениеРазмера(Оповещение);

КонецПроцедуры // ОбработатьВыборФайла()

&НаКлиенте
Процедура ПослеЗавершенияПолучениеРазмераФайла(РазмерФайла, ДополнительныеПараметры) Экспорт

	АдресИзображения = ДополнительныеПараметры.АдресИзображения;
	Элементы.ПостерОтсутствует.Видимость= Ложь;
	Элементы.АдресИзображения.Видимость = Истина;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресИзображения);
	ВремКартинка   = Новый Картинка(ДвоичныеДанные);
	
	Модифицированность = Истина;
	Объект.РазмерИзображения = РазмерФайла;
#Если НЕ ВебКлиент Тогда
	Объект.ВысотаИзображения = ВремКартинка.Высота();
	Объект.ШиринаИзображения = ВремКартинка.Ширина();
#КонецЕсли
	Элементы.ДекорацияБайт.Заголовок = ПолучитьСклонениеОбъема(РазмерФайла);
	
	Если МаксимальныйРазмерИзображения > 0 И РазмерФайла > МаксимальныйРазмерИзображения Тогда
		Пояснение = СтрЗаменить(СтрЗаменить(НСтр("ru = 'Размер изображения составляет: %1 %2!'"), "%1", РазмерФайла), "%2", ПолучитьСклонениеОбъема(РазмерФайла));
		ПоказатьОповещениеПользователя(НСтр("ru = 'Большой размер файла'"), , Пояснение);
	КонецЕсли;
	
	ОтразитьНадписьРазмерИзображения(ЭтотОбъект, РазмерФайла);

КонецПроцедуры // ПослеЗавершенияПолучениеРазмераФайла()

&НаСервере
Процедура ЗаполнитьЖанрыИСтраныФильма()

	// Жанры
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Жанр,
		|	ИСТИНА КАК Относится
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|ГДЕ
		|	ЖанрыФильмов.Фильм = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛОЖЬ КАК Относится,
		|	Жанры.Ссылка КАК Жанр,
		|	Жанры.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Жанры КАК Жанры
		|ГДЕ
		|	НЕ Жанры.ПометкаУдаления
		|	И НЕ Жанры.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ.Жанр
		|				ИЗ
		|					ВТ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ.Относится,
		|	ВТ.Жанр,
		|	ВТ.Жанр.Наименование
		|ИЗ
		|	ВТ КАК ВТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Относится УБЫВ,
		|	Наименование");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	Жанры.Загрузить(Запрос.Выполнить().Выгрузить());	

	// Страны
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Страна,
		|	ИСТИНА КАК Относится
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|ГДЕ
		|	СтраныПроизводители.Фильм = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛОЖЬ КАК Относится,
		|	Страны.Ссылка КАК Страна,
		|	Страны.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Страны КАК Страны
		|ГДЕ
		|	НЕ Страны.ПометкаУдаления
		|	И НЕ Страны.Ссылка В
		|				(ВЫБРАТЬ
		|					ВТ.Страна
		|				ИЗ
		|					ВТ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ.Относится,
		|	ВТ.Страна,
		|	ВТ.Страна.Наименование
		|ИЗ
		|	ВТ КАК ВТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Относится УБЫВ,
		|	Наименование");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	Страны.Загрузить(Запрос.Выполнить().Выгрузить());	
	
	// Флаги
	Для каждого тСтрана Из Страны Цикл		
		тСтрана.Флаг = тСтрана.Страна.Флаг.Получить();
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьЖанрыИСтраныФильма()

&НаСервере
Процедура ЗаполнитьАннотациюФильма()

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Аннотации.СодержаниеАннотации КАК СодержаниеАннотации
		|ИЗ
		|	Справочник.Аннотации КАК Аннотации
		|ГДЕ
		|	НЕ Аннотации.ПометкаУдаления
		|	И Аннотации.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	НачалоHTML =
		"<html>
		|	<body>
		|		<style>
		|			p {
		|			font-family	: Arial;
		|			font-size	: 10pt;
		|			  }
		|		</style>
		|";
	ОкончаниеHTML =
		"	</body>
		|</html>";
	ПСHTML = "<br>";
	
	Аннотация = НачалоHTML;
	
	Пока Выборка.Следующий() Цикл
		СодержаниеАннотации = СтрЗаменить(Выборка.СодержаниеАннотации, Символы.ПС, ПСHTML);
		Аннотация = Аннотация + "<p>" + СодержаниеАннотации + "</p>";
	КонецЦикла;
	
	Аннотация = Аннотация + ОкончаниеHTML;

КонецПроцедуры // ЗаполнитьАннотациюФильма()

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Отказ) Экспорт

    Если Результат = КодВозвратаДиалога.Нет Тогда
        Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПослеОтветаНаВопрос()

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСклонениеОбъема(РазмерИзображения)

	Если РазмерИзображения = 0 Тогда
		Возврат НСтр("ru = 'байт'");
	КонецЕсли;
	
	ЧислоСтрокой	= Формат(РазмерИзображения, "ЧГ=0");
	ПоследняяЦифра	= Число(Прав(ЧислоСтрокой, 1));

	Если ПоследняяЦифра < 2 ИЛИ ПоследняяЦифра > 4 Тогда
		Возврат НСтр("ru = 'байт'");
	КонецЕсли;
	
	Возврат НСтр("ru = 'байта'");
	
КонецФункции // ПолучитьСклонениеОбъема()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьРеквизитаИмяФайла(Форма, ЕстьВФильмотеке)

	Если ЕстьВФильмотеке Тогда
		Форма.Элементы.ИмяФайла.Видимость = Истина;
		Форма.Элементы.ГруппаРазмерФайла.Видимость = Истина;
	Иначе
		Форма.Элементы.ИмяФайла.Видимость = Ложь;
		Форма.Элементы.ГруппаРазмерФайла.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры // УстановитьВидимостьРеквизитаИмяФайла()

&НаКлиентеНаСервереБезКонтекста
Процедура ОтразитьНадписьРазмерИзображения(Форма, РазмерИзображения)

	МаксимальныйРазмерИзображения = Форма.МаксимальныйРазмерИзображения;
	
	Если МаксимальныйРазмерИзображения = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементРазмерИзображения = Форма.Элементы.РазмерИзображения;
	
	Если РазмерИзображения > МаксимальныйРазмерИзображения Тогда
		ЭлементРазмерИзображения.Шрифт = Новый Шрифт(, , Истина);
	Иначе
		ЭлементРазмерИзображения.Шрифт = Новый Шрифт(, , Ложь);
	КонецЕсли;
	
	Форма.Элементы.РазмерИзображения.Заголовок = СтрШаблон(НСтр("ru = 'Размер изображения (%1 x %2)'"), Форма.Объект.ВысотаИзображения, Форма.Объект.ШиринаИзображения);
	Форма.Элементы.РазмерИзображения.Подсказка = СтрШаблон(НСтр("ru = '%1 x %2'"), Форма.Объект.ВысотаИзображения, Форма.Объект.ШиринаИзображения);

КонецПроцедуры // ОтразитьНадписьРазмерИзображения()

&НаКлиенте
Асинх Процедура ПослеВводаЗначения(IDНаКиноПоиске, ДопПараметры) Экспорт
	
	Если IDНаКиноПоиске = Неопределено Тогда
		Возврат;
	КонецЕсли;

#Если ВебКлиент Тогда
	ВременныйФайл = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".jpg";
#Иначе	
	ВременныйФайл = ПолучитьИмяВременногоФайла("jpg");
#КонецЕсли
	ДопПараметры = Новый Структура("ВременныйФайл", ВременныйФайл);	
	ТекПуть      = СтрШаблон("images/film_big/%1.jpg", IDНаКиноПоиске);
	ХТТП         = Новый HTTPСоединение("st.kp.yandex.net", , , , , , Новый ЗащищенноеСоединениеOpenSSL);
	
	Попытка
		ОтветСервера = Ждать ХТТП.ПолучитьАсинх(ТекПуть, ВременныйФайл);
		Нахождение   = ОтветСервера.Заголовки.Получить("Location");
		Если Нахождение <> Неопределено Тогда
			Нахождение = СтрЗаменить(Нахождение, "https://", "");
			Вхождение  = СтрНайти(Нахождение, "/");
			Если Вхождение > 0 Тогда
				ХранилищеWebp = Лев(Нахождение, Вхождение - 1);
				Соединение    = Новый HTTPСоединение(ХранилищеWebp, , , , , , Новый ЗащищенноеСоединениеOpenSSL());
				ТекПуть       = СтрЗаменить(Нахождение, ХранилищеWebp, "");
				ОтветСервера  = Ждать Соединение.ПолучитьАсинх(ТекПуть, ВременныйФайл);
			КонецЕсли;
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка подключения к сайту; по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;

	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект, ДопПараметры);
	НачатьПомещениеФайлаНаСервер(Оповещение, , , , ВременныйФайл, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ТекстИзБуфераОбмена()
	
    Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
        Если Ждать СредстваБуфераОбмена.СодержитДанныеАсинх(СтандартныйФорматДанныхБуфераОбмена.Текст) Тогда
            Возврат Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(СтандартныйФорматДанныхБуфераОбмена.Текст);
        КонецЕсли;
    КонецЕсли;
	
    Возврат "";
		
КонецФункции

#КонецОбласти
